onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_СтандартныеРассылкиMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_СтандартныеРассылкиMAX</Name>
			<Comment>бит_Сафаров ШИ: служебное соответствие стандартных сценариев рассылок выбранному боту.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСтандарта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтпечатокНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_ОчередьРассылокMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_ОчередьРассылокMAX</Name>
			<Comment>бит_Сафаров ШИ: постоянная очередь и журнал идемпотентной доставки пациентам MAX.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторСценария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/CommonModules/бит_омни_РассылкиMAXСервер/Ext/Module.bsl
//+бит_Сафаров ШИ 19.08.2026

#Область ПрограммныйИнтерфейс

Процедура бит_ПоставитьЗапросПодтвержденияВОчередь(Заявка) Экспорт

	Если Не ЗначениеЗаполнено(Заявка) Или бит_ЗаявкаПодтверждена(Заявка) Тогда
		Возврат;
	КонецЕсли;

	бит_ПоставитьСобытиеВОчередь(
		Заявка,
		"MAX_APPOINTMENT_CONFIRM_REQUEST",
		ТекущаяДатаСеанса());

КонецПроцедуры

Процедура бит_ПоставитьПодтверждениеВОчередь(Заявка) Экспорт

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Возврат;
	КонецЕсли;

	бит_ПоставитьСобытиеВОчередь(
		Заявка,
		"MAX_APPOINTMENT_CONFIRMED",
		ТекущаяДатаСеанса());

КонецПроцедуры

Функция бит_ЗаявкаПодтверждена(Заявка) Экспорт

	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Возврат Ложь;
	КонецЕсли;

	ПризнакПодтвержденнойЗаявки =
		УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПризнакПодтвержденнойЗаявки");
	Если Не ЗначениеЗаполнено(ПризнакПодтвержденнойЗаявки) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(ПризнакПодтвержденнойЗаявки) = Тип("СправочникСсылка.ВидыСостоянийЗаявок") Тогда
		Состояние = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "Состояние");
		Возврат Состояние = ПризнакПодтвержденнойЗаявки;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияСвойств.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойств
	|ГДЕ
	|	ЗначенияСвойств.Объект = &Объект
	|	И ЗначенияСвойств.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект", Заявка);
	Запрос.УстановитьПараметр("Свойство", ПризнакПодтвержденнойЗаявки);

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий() И Выборка.Значение = Истина;

КонецФункции

Функция бит_ЭтоУправляемаяСтандартнаяРассылка(Рассылка) Экспорт

	Если Не ЗначениеЗаполнено(Рассылка) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтандартныеРассылки.Рассылка КАК Рассылка
	|ИЗ
	|	РегистрСведений.бит_омни_СтандартныеРассылкиMAX КАК СтандартныеРассылки
	|ГДЕ
	|	СтандартныеРассылки.Рассылка = &Рассылка";
	Запрос.УстановитьПараметр("Рассылка", Рассылка);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Процедура бит_ОбеспечитьРегламентноеЗадание() Экспорт

	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДатаНачала = ТекущаяДатаСеанса();
	Расписание.ПериодПовтораДней = 1;
	Расписание.ПериодПовтораВТечениеДня = 300;
	Для НомерДня = 1 По 7 Цикл
		Расписание.ДниНедели.Добавить(НомерДня);
	КонецЦикла;

	КлючЗадания = "бит_омни_РассылкиMAX";
	ОбработчикЗадания = "бит_омни_РаботаССообщениями.Рассылки();";
	Задание = РаботаСРасширениями.НайтиРегламентноеЗаданиеРасширенияПоКлючу(КлючЗадания);
	Если Задание = Неопределено Тогда
		РаботаСРасширениями.ДобавитьРегламентноеЗаданиеРасширения(
			КлючЗадания,
			ОбработчикЗадания,
			"ОМНИ: очередь и напоминания MAX",
			Расписание);
		Возврат;
	КонецЕсли;

	Задание.Наименование = "ОМНИ: очередь и напоминания MAX";
	Задание.Использование = Истина;
	ЗаполнитьЗначенияСвойств(Задание.Расписание, Расписание);
	Задание.Параметры.Очистить();
	Задание.Параметры.Добавить(ОбработчикЗадания);
	Задание.Записать();

КонецПроцедуры

Процедура бит_ОбработатьОчередь() Экспорт

	бит_СформироватьОчередьНапоминаний();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	Очередь.Бот КАК Бот,
	|	Очередь.КлючСобытия КАК КлючСобытия
	|ИЗ
	|	РегистрСведений.бит_омни_ОчередьРассылокMAX КАК Очередь
	|ГДЕ
	|	Очередь.Статус В(&Статусы)
	|	И Очередь.ДатаВыполнения <= &ТекущаяДата
	|	И (Очередь.СледующаяПопытка = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ Очередь.СледующаяПопытка <= &ТекущаяДата)
	|УПОРЯДОЧИТЬ ПО
	|	Очередь.ДатаВыполнения";

	Статусы = Новый Массив;
	Статусы.Добавить("Ожидает");
	Статусы.Добавить("Повтор");
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		бит_ОбработатьСтрокуОчереди(Выборка.Бот, Выборка.КлючСобытия);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бит_ПоставитьСобытиеВОчередь(Заявка, ИдентификаторСценария, ДатаВыполнения, ДатаЗаписи = Неопределено)

	ДанныеЗаявки = бит_ДанныеЗаявки(Заявка);
	Если ДанныеЗаявки = Неопределено Или Не ЗначениеЗаполнено(ДанныеЗаявки.Клиент) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтандартныеРассылки.Бот КАК Бот,
	|	СтандартныеРассылки.Рассылка КАК Рассылка
	|ИЗ
	|	РегистрСведений.бит_омни_СтандартныеРассылкиMAX КАК СтандартныеРассылки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_АктивныеРассылки КАК АктивныеРассылки
	|		ПО СтандартныеРассылки.Бот = АктивныеРассылки.Бот
	|			И СтандартныеРассылки.Рассылка = АктивныеРассылки.Рассылка
	|ГДЕ
	|	СтандартныеРассылки.ИдентификаторСценария = &ИдентификаторСценария
	|	И НЕ СтандартныеРассылки.Рассылка.ПометкаУдаления
	|	И СтандартныеРассылки.Бот.Использовать";
	Запрос.УстановитьПараметр("ИдентификаторСценария", ИдентификаторСценария);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		КлючСобытия = бит_КлючСобытия(ИдентификаторСценария, Заявка, ДатаЗаписи);
		Если бит_СтрокаОчередиСуществует(Выборка.Бот, КлючСобытия) Тогда
			Продолжить;
		КонецЕсли;

		ЗаписьОчереди = РегистрыСведений.бит_омни_ОчередьРассылокMAX.СоздатьМенеджерЗаписи();
		ЗаписьОчереди.Бот = Выборка.Бот;
		ЗаписьОчереди.КлючСобытия = КлючСобытия;
		ЗаписьОчереди.ИдентификаторСценария = ИдентификаторСценария;
		ЗаписьОчереди.Рассылка = Выборка.Рассылка;
		ЗаписьОчереди.Заявка = Заявка;
		ЗаписьОчереди.Клиент = ДанныеЗаявки.Клиент;
		ЗаписьОчереди.ДатаВыполнения = ДатаВыполнения;
		ЗаписьОчереди.ДатаЗаписи = ?(ДатаЗаписи = Неопределено, ДанныеЗаявки.ДатаНачала, ДатаЗаписи);
		ЗаписьОчереди.Статус = "Ожидает";
		ЗаписьОчереди.КоличествоПопыток = 0;
		ЗаписьОчереди.Записать();

	КонецЦикла;

КонецПроцедуры

Процедура бит_СформироватьОчередьНапоминаний()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтандартныеРассылки.Бот КАК Бот,
	|	СтандартныеРассылки.Рассылка КАК Рассылка,
	|	СтандартныеРассылки.Рассылка.Расписание КАК Расписание,
	|	АктивныеРассылки.ДатаНачалаПоследнегоЗапуска КАК ДатаНачалаПоследнегоЗапуска,
	|	АктивныеРассылки.ДатаЗавершенияПоследнегоЗапуска КАК ДатаЗавершенияПоследнегоЗапуска
	|ИЗ
	|	РегистрСведений.бит_омни_СтандартныеРассылкиMAX КАК СтандартныеРассылки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_АктивныеРассылки КАК АктивныеРассылки
	|		ПО СтандартныеРассылки.Бот = АктивныеРассылки.Бот
	|			И СтандартныеРассылки.Рассылка = АктивныеРассылки.Рассылка
	|ГДЕ
	|	СтандартныеРассылки.ИдентификаторСценария = &ИдентификаторСценария
	|	И НЕ СтандартныеРассылки.Рассылка.ПометкаУдаления
	|	И СтандартныеРассылки.Бот.Использовать";
	Запрос.УстановитьПараметр("ИдентификаторСценария", "MAX_APPOINTMENT_REMINDER");

	ТекущаяДата = ТекущаяДатаСеанса();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Расписание = Выборка.Расписание.Получить();
		Если ТипЗнч(Расписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
			Продолжить;
		КонецЕсли;

		Если Не Расписание.ТребуетсяВыполнение(
			ТекущаяДата,
			Выборка.ДатаНачалаПоследнегоЗапуска,
			Выборка.ДатаЗавершенияПоследнегоЗапуска) Тогда
			Продолжить;
		КонецЕсли;

		бит_ОтметитьНачалоРассылки(Выборка.Бот, Выборка.Рассылка, ТекущаяДата);

		ДатаНачалаОкна = ?(
			ЗначениеЗаполнено(Выборка.ДатаЗавершенияПоследнегоЗапуска),
			Выборка.ДатаЗавершенияПоследнегоЗапуска + 7200,
			ТекущаяДата + 7200);
		Если ДатаНачалаОкна < ТекущаяДата Тогда
			ДатаНачалаОкна = ТекущаяДата;
		КонецЕсли;
		ДатаОкончанияОкна = ТекущаяДата + 7200 + 300;

		бит_ПоставитьНапоминанияВОчередь(
			Выборка.Бот,
			Выборка.Рассылка,
			ДатаНачалаОкна,
			ДатаОкончанияОкна,
			ТекущаяДата);

		бит_ОтметитьЗавершениеРассылки(Выборка.Бот, Выборка.Рассылка, ТекущаяДатаСеанса());

	КонецЦикла;

КонецПроцедуры

Процедура бит_ПоставитьНапоминанияВОчередь(Бот, Рассылка, ДатаНачалаОкна, ДатаОкончанияОкна, ДатаВыполнения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Заявка.Ссылка КАК Заявка,
	|	Заявка.Клиент КАК Клиент,
	|	Заявка.ДатаНачала КАК ДатаНачала
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	НЕ Заявка.ПометкаУдаления
	|	И Заявка.ДатаНачала >= &ДатаНачалаОкна
	|	И Заявка.ДатаНачала <= &ДатаОкончанияОкна
	|	И Заявка.ДатаНачала > &ТекущаяДата
	|	И Заявка.Состояние.ТипСостояния <> ЗНАЧЕНИЕ(Перечисление.ТипыСостоянийЗаявок.Отменена)";
	Запрос.УстановитьПараметр("ДатаНачалаОкна", ДатаНачалаОкна);
	Запрос.УстановитьПараметр("ДатаОкончанияОкна", ДатаОкончанияОкна);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		КлючСобытия = бит_КлючСобытия("MAX_APPOINTMENT_REMINDER", Выборка.Заявка, Выборка.ДатаНачала);
		Если бит_СтрокаОчередиСуществует(Бот, КлючСобытия) Тогда
			Продолжить;
		КонецЕсли;

		ЗаписьОчереди = РегистрыСведений.бит_омни_ОчередьРассылокMAX.СоздатьМенеджерЗаписи();
		ЗаписьОчереди.Бот = Бот;
		ЗаписьОчереди.КлючСобытия = КлючСобытия;
		ЗаписьОчереди.ИдентификаторСценария = "MAX_APPOINTMENT_REMINDER";
		ЗаписьОчереди.Рассылка = Рассылка;
		ЗаписьОчереди.Заявка = Выборка.Заявка;
		ЗаписьОчереди.Клиент = Выборка.Клиент;
		ЗаписьОчереди.ДатаВыполнения = ДатаВыполнения;
		ЗаписьОчереди.ДатаЗаписи = Выборка.ДатаНачала;
		ЗаписьОчереди.Статус = "Ожидает";
		ЗаписьОчереди.Записать();

	КонецЦикла;

КонецПроцедуры

Процедура бит_ОбработатьСтрокуОчереди(Бот, КлючСобытия)

	ЗаписьОчереди = РегистрыСведений.бит_омни_ОчередьРассылокMAX.СоздатьМенеджерЗаписи();
	ЗаписьОчереди.Бот = Бот;
	ЗаписьОчереди.КлючСобытия = КлючСобытия;
	ЗаписьОчереди.Прочитать();

	Если Не бит_РассылкаАктивна(ЗаписьОчереди.Бот, ЗаписьОчереди.Рассылка) Тогда
		бит_УстановитьСтатус(ЗаписьОчереди, "Пропущено", "Рассылка отключена для бота.");
		Возврат;
	КонецЕсли;

	ДанныеЗаявки = бит_ДанныеЗаявки(ЗаписьОчереди.Заявка);
	Если ДанныеЗаявки = Неопределено Или ДанныеЗаявки.Отменена Тогда
		бит_УстановитьСтатус(ЗаписьОчереди, "Пропущено", "Заявка отсутствует, удалена или отменена.");
		Возврат;
	КонецЕсли;

	Если ЗаписьОчереди.ИдентификаторСценария = "MAX_APPOINTMENT_CONFIRM_REQUEST"
		И бит_ЗаявкаПодтверждена(ЗаписьОчереди.Заявка) Тогда
		бит_УстановитьСтатус(ЗаписьОчереди, "Пропущено", "Заявка уже подтверждена.");
		Возврат;
	КонецЕсли;

	Если ЗаписьОчереди.ИдентификаторСценария = "MAX_APPOINTMENT_CONFIRMED"
		И Не бит_ЗаявкаПодтверждена(ЗаписьОчереди.Заявка) Тогда
		бит_ПовторитьПозже(ЗаписьОчереди, "Подтверждение заявки еще не зафиксировано.");
		Возврат;
	КонецЕсли;

	Шаблон = ЗаписьОчереди.Рассылка.Шаблон;
	Если ЗаписьОчереди.ИдентификаторСценария = "MAX_APPOINTMENT_REMINDER"
		И бит_ЗаявкаПодтверждена(ЗаписьОчереди.Заявка) Тогда
		Шаблон = Справочники.бит_омни_ШаблоныСообщений.СтандартныйШаблон(
			"MAX_APPOINTMENT_REMINDER_CONFIRMED");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Шаблон) Тогда
		бит_УстановитьСтатус(ЗаписьОчереди, "Ошибка", "Не найден шаблон сообщения.");
		Возврат;
	КонецЕсли;

	Контекст = бит_КонтекстЗаявки(ЗаписьОчереди.Заявка, ДанныеЗаявки);

	Попытка
		РезультатОтправки = бит_омни_ИнтеграцияСMAX.ОтправитьСообщение(
			Шаблон,
			ДанныеЗаявки.Клиент,
			ЗаписьОчереди.Бот,
			Контекст);

		Если Не бит_УспешныйРезультатОтправки(РезультатОтправки) Тогда
			бит_ПовторитьПозже(ЗаписьОчереди, бит_ОписаниеРезультатаОтправки(РезультатОтправки));
			Возврат;
		КонецЕсли;

		ЗаписьОчереди.Статус = "Отправлено";
		ЗаписьОчереди.ДатаОтправки = ТекущаяДатаСеанса();
		ЗаписьОчереди.ТекстОшибки = "";
		ЗаписьОчереди.Записать();
	Исключение
		бит_ПовторитьПозже(
			ЗаписьОчереди,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Функция бит_ДанныеЗаявки(Заявка)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Заявка.Клиент КАК Клиент,
	|	Заявка.ДатаНачала КАК ДатаНачала,
	|	Заявка.Сотрудник КАК Сотрудник,
	|	Заявка.Филиал КАК Филиал,
	|	Заявка.ПометкаУдаления КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА Заявка.Состояние.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.ТипыСостоянийЗаявок.Отменена)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Отменена
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка = &Заявка";
	Запрос.УстановитьПараметр("Заявка", Заявка);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Выборка.ПометкаУдаления Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура(
		"Клиент, ДатаНачала, Сотрудник, Филиал, Отменена",
		Выборка.Клиент,
		Выборка.ДатаНачала,
		Выборка.Сотрудник,
		Выборка.Филиал,
		Выборка.Отменена);

КонецФункции

Функция бит_КонтекстЗаявки(Заявка, ДанныеЗаявки)

	Возврат Новый Структура(
		"appointment_id, appointment_date, appointment_time, doctor, address",
		Строка(Заявка.УникальныйИдентификатор()),
		ДанныеЗаявки.ДатаНачала,
		ДанныеЗаявки.ДатаНачала,
		ДанныеЗаявки.Сотрудник,
		ДанныеЗаявки.Филиал);

КонецФункции

Функция бит_КлючСобытия(ИдентификаторСценария, Заявка, ДатаЗаписи)

	Ключ = ИдентификаторСценария + ":" + Строка(Заявка.УникальныйИдентификатор());
	Если ЗначениеЗаполнено(ДатаЗаписи) И ИдентификаторСценария = "MAX_APPOINTMENT_REMINDER" Тогда
		Ключ = Ключ + ":" + Формат(ДатаЗаписи, "ДФ=yyyyMMddHHmmss");
	КонецЕсли;
	Возврат Ключ;

КонецФункции

Функция бит_СтрокаОчередиСуществует(Бот, КлючСобытия)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Очередь.КлючСобытия КАК КлючСобытия
	|ИЗ
	|	РегистрСведений.бит_омни_ОчередьРассылокMAX КАК Очередь
	|ГДЕ
	|	Очередь.Бот = &Бот
	|	И Очередь.КлючСобытия = &КлючСобытия";
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("КлючСобытия", КлючСобытия);
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция бит_РассылкаАктивна(Бот, Рассылка)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	АктивныеРассылки.Рассылка КАК Рассылка
	|ИЗ
	|	РегистрСведений.бит_омни_АктивныеРассылки КАК АктивныеРассылки
	|ГДЕ
	|	АктивныеРассылки.Бот = &Бот
	|	И АктивныеРассылки.Рассылка = &Рассылка
	|	И НЕ АктивныеРассылки.Рассылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("Рассылка", Рассылка);
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Процедура бит_ОтметитьНачалоРассылки(Бот, Рассылка, ДатаНачала)

	Запись = РегистрыСведений.бит_омни_АктивныеРассылки.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Рассылка = Рассылка;
	Запись.Прочитать();
	Запись.ДатаНачалаПоследнегоЗапуска = ДатаНачала;
	Запись.Записать();

КонецПроцедуры

Процедура бит_ОтметитьЗавершениеРассылки(Бот, Рассылка, ДатаЗавершения)

	Запись = РегистрыСведений.бит_омни_АктивныеРассылки.СоздатьМенеджерЗаписи();
	Запись.Бот = Бот;
	Запись.Рассылка = Рассылка;
	Запись.Прочитать();
	Запись.ДатаЗавершенияПоследнегоЗапуска = ДатаЗавершения;
	Запись.Записать();

КонецПроцедуры

Процедура бит_УстановитьСтатус(ЗаписьОчереди, Статус, ТекстОшибки)

	ЗаписьОчереди.Статус = Статус;
	ЗаписьОчереди.ТекстОшибки = Лев(ТекстОшибки, 1000);
	ЗаписьОчереди.Записать();

КонецПроцедуры

Процедура бит_ПовторитьПозже(ЗаписьОчереди, ТекстОшибки)

	ЗаписьОчереди.КоличествоПопыток = ЗаписьОчереди.КоличествоПопыток + 1;
	Если ЗаписьОчереди.КоличествоПопыток >= 5 Тогда
		ЗаписьОчереди.Статус = "Ошибка";
	Иначе
		ЗаписьОчереди.Статус = "Повтор";
		ЗаписьОчереди.СледующаяПопытка = ТекущаяДатаСеанса() + 300;
	КонецЕсли;
	ЗаписьОчереди.ТекстОшибки = Лев(ТекстОшибки, 1000);
	ЗаписьОчереди.Записать();

КонецПроцедуры

Функция бит_УспешныйРезультатОтправки(РезультатОтправки)

	Если РезультатОтправки = Неопределено Или РезультатОтправки = Null Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(РезультатОтправки) = Тип("Структура") Тогда
		Успех = Истина;
		Если РезультатОтправки.Свойство("success", Успех) И Не Успех Тогда
			Возврат Ложь;
		КонецЕсли;
		Ошибка = Неопределено;
		Если РезультатОтправки.Свойство("error", Ошибка) И ЗначениеЗаполнено(Ошибка) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция бит_ОписаниеРезультатаОтправки(РезультатОтправки)

	Если РезультатОтправки = Неопределено Или РезультатОтправки = Null Тогда
		Возврат "MAX не вернул результат отправки.";
	КонецЕсли;

	Если ТипЗнч(РезультатОтправки) = Тип("Структура") Тогда
		Текст = "";
		Если РезультатОтправки.Свойство("message", Текст) И ЗначениеЗаполнено(Текст) Тогда
			Возврат Строка(Текст);
		КонецЕсли;
		Если РезультатОтправки.Свойство("error", Текст) И ЗначениеЗаполнено(Текст) Тогда
			Возврат Строка(Текст);
		КонецЕсли;
	КонецЕсли;

	Возврат "MAX отклонил сообщение.";

КонецФункции

#КонецОбласти

//-бит_Сафаров ШИ 19.08.2026
